TexasInstruments/c2000ware-core-sdk/driverlib/f28p65x/examples/c28x/uart/uart_ex2_loopback.syscfg
/**
 * Import the modules used in this configuration.
 */
const uart  = scripting.addModule("/driverlib/uart.js", {}, false);
const uart1 = uart.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
uart1.$name                   = "myUART0";
uart1.fen                     = true;
uart1.enInterrupt             = false;
uart1.uart.$assign            = "UARTA";
uart1.uart.uart_txPin.$assign = "GPIO2";
uart1.uart.uart_rxPin.$assign = "GPIO3";